Documents/ИзменениеСтатусаЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Document>		<InternalInfo>			<xr:GeneratedType name="DocumentObject.ИзменениеСтатусаЗаказа" category="Object">				<xr:TypeId>a1b86133-69b2-4835-946a-d598c77cf17b</xr:TypeId>				<xr:ValueId>52bb0970-85cd-4093-a846-dee267f676a1</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DocumentRef.ИзменениеСтатусаЗаказа" category="Ref">				<xr:TypeId>5b3fb2cd-3a3a-4e76-bc9c-3e3788fbc048</xr:TypeId>				<xr:ValueId>c0db5eab-c99c-4e23-966a-67dac337842e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DocumentSelection.ИзменениеСтатусаЗаказа" category="Selection">				<xr:TypeId>8c17f429-38a1-4fac-9541-20295cdcc856</xr:TypeId>				<xr:ValueId>b3233331-2d7a-47b5-9a0b-c64f5490580e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DocumentList.ИзменениеСтатусаЗаказа" category="List">				<xr:TypeId>78eff257-af19-4a27-a40c-33941849a673</xr:TypeId>				<xr:ValueId>44dad8a0-2d91-4cd4-9bd7-ef1922f1ed74</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DocumentManager.ИзменениеСтатусаЗаказа" category="Manager">				<xr:TypeId>2d34f5bd-5115-4626-9a1d-93be1c14c57a</xr:TypeId>				<xr:ValueId>f9e211c1-1cb5-4b24-a4bf-e4f4869c91ed</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ИзменениеСтатусаЗаказа</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Изменение статуса заказа</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<Numerator/>			<NumberType>String</NumberType>			<NumberLength>9</NumberLength>			<NumberAllowedLength>Variable</NumberAllowedLength>			<NumberPeriodicity>Nonperiodical</NumberPeriodicity>			<CheckUnique>true</CheckUnique>			<Autonumbering>true</Autonumbering>			<Characteristics/>			<BasedOn/>			<InputByString>				<xr:Field>Document.ИзменениеСтатусаЗаказа.StandardAttribute.Number</xr:Field>			</InputByString>			<CreateOnInput>Use</CreateOnInput>			<SearchStringModeOnInputByString>Begin</SearchStringModeOnInputByString>			<FullTextSearchOnInputByString>DontUse</FullTextSearchOnInputByString>			<ChoiceDataGetModeOnInputByString>Directly</ChoiceDataGetModeOnInputByString>			<DefaultObjectForm/>			<DefaultListForm/>			<DefaultChoiceForm/>			<AuxiliaryObjectForm/>			<AuxiliaryListForm/>			<AuxiliaryChoiceForm/>			<Posting>Allow</Posting>			<RealTimePosting>Allow</RealTimePosting>			<RegisterRecordsDeletion>AutoDeleteOnUnpost</RegisterRecordsDeletion>			<RegisterRecordsWritingOnPost>WriteSelected</RegisterRecordsWritingOnPost>			<SequenceFilling>AutoFill</SequenceFilling>			<RegisterRecords>				<xr:Item>InformationRegister.СтатусыЗаказов</xr:Item>			</RegisterRecords>			<PostInPrivilegedMode>true</PostInPrivilegedMode>			<UnpostInPrivilegedMode>true</UnpostInPrivilegedMode>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockFields/>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>Use</FullTextSearch>			<ObjectPresentation/>			<ExtendedObjectPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Attribute>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>Статус</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Статус</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Form>ФормаИзмененияСпискаЗаказов</Form>			<Command>				<Properties>					<Name>ИзменениеСтатусаЗаказов</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Изменение статуса заказов</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Group>NavigationPanelOrdinary</Group>					<CommandParameterType/>					<ParameterUseMode>Single</ParameterUseMode>					<ModifiesData>false</ModifiesData>					<Representation>Auto</Representation>					<ToolTip/>					<Picture/>					<Shortcut/>					<OnMainServerUnavalableBehavior>Auto</OnMainServerUnavalableBehavior>				</Properties>			</Command>		</ChildObjects>	</Document></MetaDataObject>

InformationRegisters/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.СтатусыЗаказов" category="Record">				<xr:TypeId>4ada137c-79a6-42f5-8277-88a79abfdc86</xr:TypeId>				<xr:ValueId>92a6b418-411f-4ca4-aca3-bb44f2f94f21</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.СтатусыЗаказов" category="Manager">				<xr:TypeId>356ec2a0-0439-4dcb-82a5-09b5c3b5f547</xr:TypeId>				<xr:ValueId>6d3120ae-1b6c-49b2-9e78-308bf0f8e24e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.СтатусыЗаказов" category="Selection">				<xr:TypeId>853c15ba-878b-449e-9089-8fbc9394389f</xr:TypeId>				<xr:ValueId>3603d531-d410-445c-93c6-d39524933122</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.СтатусыЗаказов" category="List">				<xr:TypeId>8b03475a-6726-4b8d-ab10-eb19c3963896</xr:TypeId>				<xr:ValueId>dd04c6a4-e39a-4d06-a58c-1657320b417e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.СтатусыЗаказов" category="RecordSet">				<xr:TypeId>1ec172db-54f9-43b5-be58-1e09bd1ebd04</xr:TypeId>				<xr:ValueId>a7e6f87d-209c-4c1d-a0e9-972f0e4f656c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.СтатусыЗаказов" category="RecordKey">				<xr:TypeId>930062d2-a058-4eca-b88f-c13e137d529b</xr:TypeId>				<xr:ValueId>6172de83-9a32-448d-96d3-c858fe1ff06b</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.СтатусыЗаказов" category="RecordManager">				<xr:TypeId>7ab5e2b5-52e4-4837-92df-259686434b73</xr:TypeId>				<xr:ValueId>d9b0271b-48d1-45ac-a1f4-7037d31e49c1</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>СтатусыЗаказов</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Статусы заказов</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>			<WriteMode>RecorderSubordinate</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Статус</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Статус</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

Documents/ИзменениеСтатусаЗаказа/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СтатусыЗаказов.Записывать = Истина;
	Движение = Движения.СтатусыЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Статус = Статус;
	
	МассивОбменов = Справочники.НетиповыеОбменыДанными.ПолучитьОбменыПоИмениОбработки(
		Метаданные.Обработки.QLS_STATUSES_UNLOAD.Имя);
	Для каждого ВидВыгрузкиДанных Из МассивОбменов Цикл
		НетиповыеОбмены.ЗарегистрироватьИзмененияОбъектаВПланеОбмена(Ссылка, ВидВыгрузкиДанных);
	КонецЦикла;	

КонецПроцедуры
